window.addEventListener('load', function (){
    let preloader = document.querySelector('.preloader');
    window.setTimeout(()=>{
        preloader.style.opacity = 0;
    }, 1000)
    window.setTimeout(()=>{
        preloader.style.display = 'none';
    }, 3000)
})



    

let carArr = [
    {name:'Аварійна посадка', ser:'800', zoloto:'немає', sexpau:'50 сухих пайків', med: '30 медикаметів', komp:'30', weapon:'Гвинтівка та револьвер', brone:'Бронежилет, бронешлем, бронештани', pet:'1 випадкова тварина', stal:'450', derevo:'300', img:'clipboard_image_88a3da2ceb03a46e.jpg', about:'Троє людей, що вижили, прокидаються в саркофагах криптосна під звук сирен і скрегіт металу. Їм ледве вдається дістатись рятувальних капсул, перш ніж корабель вибухає. Через деякий час капсули опиняються на поверхні нового, незвіданого світу.'},
    {name:'Загублене племя', ser:'200', zoloto:'немає', sexpau:'400 пеммикану', med: '20 лікарських трав', komp:'немає', weapon:'дубина з дерева, іклва зі сталі, ніж з нефриту, 2 короткіх луки, пілум', brone:'немає', pet:'3 випадкові тварини', stal:'немає', derevo:'500', img:'clipboard.jpg', about:'Пять членів племені, що загубилися, намагаються налагодити життя на невідомій планеті. Ваше племя було знищено великими кривавими машинами, посланими богами. Пятьом із вас вдалося втекти. Настав час збудувати новий будинок.'},
    {name:'Багатий дослідник', ser:'200', zoloto:'30', sexpau:'40 сухих пайків', med: '30 передових медикаментів', komp:'30', weapon:'енергетична гвинтівка', brone:'немає', pet:'1 випадкова тварина', stal:'450', derevo:'300', img:'clipboard_image_8e483613a4b5935b.jpg', about:'Багатий дослідник, що подорожує Всесвітом. Люди називали вас божевільним, але ви завжди прагнули досліджувати зірки за межами нейросимулятора. Нарешті, після довгої подорожі у криптосні ви здійснили посадку на невідомій планеті, повній загадок.'},
    {name:'Неприкрита жорстокість', ser:'немає', zoloto:'немає', sexpau:'немає', med: 'немає', komp:'немає', weapon:'немає', brone:'немає', pet:'немає', stal:'немає', derevo:'немає', img:'clipboard_image_49437f5790ce277a.jpg', about:'Останнє, що ви памятаєте, - це, як вас вводять у наркоз перед легкою операцією. А тепер ви прокидаєтеся в капсулі, що мчала до поверхні далекої планети, на самоті, без спорядження і навіть без одягу. Чи вдасться вам вижити?'},
]

let carApp = {
    data(){
        return{
            cars: carArr,
            currentCar: carArr[0],
            currentIndex: 0,


        }


    },
    methods: {
        showCar(index){
            this.currentIndex = index;
            this.currentCar = carArr[index];

        }

    },



}
Vue.createApp(carApp).mount('#car-pr');